Masmiseim36/nxpSDK/devices/MIMXRT1187/mcuxpresso/startup_mimxrt1187_cm33.c
WEAK void PWM3_1_IRQHandler(void)
{   PWM3_1_DriverIRQHandler();
}

WEAK void PWM3_2_IRQHandler(void)
{   PWM3_2_DriverIRQHandler();
}

WEAK void PWM3_3_IRQHandler(void)
{   PWM3_3_DriverIRQHandler();
}

WEAK void PWM4_FAULT_IRQHandler(void)
{   PWM4_FAULT_DriverIRQHandler();
}

WEAK void PWM4_0_IRQHandler(void)
{   PWM4_0_DriverIRQHandler();
}

WEAK void PWM4_1_IRQHandler(void)
{   PWM4_1_DriverIRQHandler();
}

WEAK void PWM4_2_IRQHandler(void)
{   PWM4_2_DriverIRQHandler();
}

WEAK void PWM4_3_IRQHandler(void)
{   PWM4_3_DriverIRQHandler();
}

WEAK void EQDC1_IRQHandler(void)
{   EQDC1_DriverIRQHandler();
}

WEAK void EQDC2_IRQHandler(void)
{   EQDC2_DriverIRQHandler();
}

WEAK void EQDC3_IRQHandler(void)
{   EQDC3_DriverIRQHandler();
}

WEAK void EQDC4_IRQHandler(void)
{   EQDC4_DriverIRQHandler();
}

WEAK void ADC2_IRQHandler(void)
{   ADC2_DriverIRQHandler();
}

WEAK void DCDC_IRQHandler(void)
{   DCDC_DriverIRQHandler();
}

WEAK void CAN3_IRQHandler(void)
{   CAN3_DriverIRQHandler();
}

WEAK void CAN3_ERROR_IRQHandler(void)
{   CAN3_ERROR_DriverIRQHandler();
}

WEAK void DAC_IRQHandler(void)
{   DAC_DriverIRQHandler();
}

WEAK void LPSPI5_IRQHandler(void)
{   LPSPI5_DriverIRQHandler();
}

WEAK void LPSPI6_IRQHandler(void)
{   LPSPI6_DriverIRQHandler();
}

WEAK void LPUART7_IRQHandler(void)
{   LPUART7_DriverIRQHandler();
}

WEAK void LPUART8_IRQHandler(void)
{   LPUART8_DriverIRQHandler();
}

WEAK void SAI2_IRQHandler(void)
{   SAI2_DriverIRQHandler();
}

WEAK void SAI3_IRQHandler(void)
{   SAI3_DriverIRQHandler();
}

WEAK void ACMP1_IRQHandler(void)
{   ACMP1_DriverIRQHandler();
}

WEAK void ACMP2_IRQHandler(void)
{   ACMP2_DriverIRQHandler();
}

WEAK void ACMP3_IRQHandler(void)
{   ACMP3_DriverIRQHandler();
}

WEAK void ACMP4_IRQHandler(void)
{   ACMP4_DriverIRQHandler();
}

WEAK void CM7_PS_IRQHandler(void)
{   CM7_PS_DriverIRQHandler();
}

WEAK void CM7_MCM_IRQHandler(void)
{   CM7_MCM_DriverIRQHandler();
}

WEAK void CM33_MCM_IRQHandler(void)
{   CM33_MCM_DriverIRQHandler();
}

WEAK void Reserved223_IRQHandler(void)
{   Reserved223_DriverIRQHandler();
}

WEAK void SAFETY_CLK_MON_IRQHandler(void)
{   SAFETY_CLK_MON_DriverIRQHandler();
}

WEAK void GPT1_IRQHandler(void)
{   GPT1_DriverIRQHandler();
}

WEAK void GPT2_IRQHandler(void)
{   GPT2_DriverIRQHandler();
}

WEAK void KPP_IRQHandler(void)
{   KPP_DriverIRQHandler();
}

WEAK void USBPHY1_IRQHandler(void)
{   USBPHY1_DriverIRQHandler();
}

WEAK void USBPHY2_IRQHandler(void)
{   USBPHY2_DriverIRQHandler();
}

WEAK void USB_OTG2_IRQHandler(void)
{   USB_OTG2_DriverIRQHandler();
}

WEAK void USB_OTG1_IRQHandler(void)
{   USB_OTG1_DriverIRQHandler();
}

WEAK void FLEXSPI_SLV_IRQHandler(void)
{   FLEXSPI_SLV_DriverIRQHandler();
}

WEAK void NETC_IRQHandler(void)
{   NETC_DriverIRQHandler();
}

WEAK void MSGINTR1_IRQHandler(void)
{   MSGINTR1_DriverIRQHandler();
}

WEAK void MSGINTR2_IRQHandler(void)
{   MSGINTR2_DriverIRQHandler();
}

WEAK void MSGINTR3_IRQHandler(void)
{   MSGINTR3_DriverIRQHandler();
}

WEAK void MSGINTR4_IRQHandler(void)
{   MSGINTR4_DriverIRQHandler();
}

WEAK void MSGINTR5_IRQHandler(void)
{   MSGINTR5_DriverIRQHandler();
}

WEAK void MSGINTR6_IRQHandler(void)
{   MSGINTR6_DriverIRQHandler();
}

WEAK void SINC1_CH0_IRQHandler(void)
{   SINC1_CH0_DriverIRQHandler();
}

WEAK void SINC1_CH1_IRQHandler(void)
{   SINC1_CH1_DriverIRQHandler();
}

WEAK void SINC1_CH2_IRQHandler(void)
{   SINC1_CH2_DriverIRQHandler();
}

WEAK void SINC1_CH3_IRQHandler(void)
{   SINC1_CH3_DriverIRQHandler();
}

WEAK void SINC2_CH0_IRQHandler(void)
{   SINC2_CH0_DriverIRQHandler();
}

WEAK void SINC2_CH1_IRQHandler(void)
{   SINC2_CH1_DriverIRQHandler();
}

WEAK void SINC2_CH2_IRQHandler(void)
{   SINC2_CH2_DriverIRQHandler();
}

WEAK void SINC2_CH3_IRQHandler(void)
{   SINC2_CH3_DriverIRQHandler();
}

WEAK void GPIO4_IRQHandler(void)
{   GPIO4_DriverIRQHandler();
}

WEAK void TMR2_IRQHandler(void)
{   TMR2_DriverIRQHandler();
}

WEAK void GPIO5_IRQHandler(void)
{   GPIO5_DriverIRQHandler();
}

WEAK void ASRC_IRQHandler(void)
{   ASRC_DriverIRQHandler();
}

WEAK void GPIO6_IRQHandler(void)
{   GPIO6_DriverIRQHandler();
}

WEAK void DBG_TRACE_IRQHandler(void)
{   DBG_TRACE_DriverIRQHandler();
}

//*****************************************************************************

#if defined (DEBUG)
#pragma GCC pop_options
#endif // (DEBUG)
